## Plan Result (braze-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197854)



<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * aws_acm_certificate.click_tracking_email_certificate_122AA20C
  * aws_cloudfront_distribution.click_tracking_cloudfront_distribution_A2F08E74
  * aws_iam_policy.data_export_braze-s3-data-access-policy_9100E5BF
  * aws_iam_role.data_export_braze-s3-data-access-role_B8571A38
  * aws_route53_zone.click_tracking_base_dns_subhosted_zone_92F4033A
  * aws_s3_bucket.data_export_data-export-bucket_F85B7146



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.data_export_braze-s3-sdk_45FEA9C8 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data_export_braze-s3-sdk_45FEA9C8" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::pocket-prod-braze-data-export",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::pocket-prod-braze-data-export/*",
            ]
        }
    }

  # aws_acm_certificate.click_tracking_email_certificate_122AA20C will be updated in-place
  ~ resource "aws_acm_certificate" "click_tracking_email_certificate_122AA20C" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/4e090eb1-790f-4857-afc3-5ebcacd91ea0"
      ~ tags                      = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Braze"
        }
      ~ tags_all                  = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.click_tracking_cloudfront_distribution_A2F08E74 will be updated in-place
  ~ resource "aws_cloudfront_distribution" "click_tracking_cloudfront_distribution_A2F08E74" {
        id                              = "EJ5XOV8NLO1RS"
      ~ tags                            = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Braze"
        }
      ~ tags_all                        = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_iam_policy.data_export_braze-s3-data-access-policy_9100E5BF will be updated in-place
  ~ resource "aws_iam_policy" "data_export_braze-s3-data-access-policy_9100E5BF" {
        id               = "arn:aws:iam::996905175585:policy/braze-s3-data-export20221011013703403800000002"
        name             = "braze-s3-data-export20221011013703403800000002"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pocket-prod-braze-data-export"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pocket-prod-braze-data-export/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all         = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.data_export_braze-s3-data-access-role_B8571A38 will be updated in-place
  ~ resource "aws_iam_role" "data_export_braze-s3-data-access-role_B8571A38" {
        id                    = "Braze-Prod20221011013702754100000001"
        name                  = "Braze-Prod20221011013702754100000001"
      ~ tags                  = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Braze"
        }
      ~ tags_all              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_route53_zone.click_tracking_base_dns_subhosted_zone_92F4033A will be updated in-place
  ~ resource "aws_route53_zone" "click_tracking_base_dns_subhosted_zone_92F4033A" {
        id                  = "Z035247539HI0FY3DCXWS"
        name                = "clicks.getpocket.com"
      ~ tags                = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Braze"
        }
      ~ tags_all            = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.data_export_data-export-bucket_F85B7146 will be updated in-place
  ~ resource "aws_s3_bucket" "data_export_data-export-bucket_F85B7146" {
        id                          = "pocket-prod-braze-data-export"
      ~ tags                        = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Braze"
        }
      ~ tags_all                    = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-braze" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"0536843b-7461-4a9d-9c86-e1fceefbb312","JobName":"braze_infrastructure_plan_prod","PRNumber":575,"Program":"tfcmt","SHA1":"35b874cb1c4719dfbb6b2d64f8ef9da60fe07f14","Target":"braze-cdk","Vars":{}} -->